app/Controllers/NoticiaFavorita.php

    public function adicionar()
    {
        // Verificar se a requisição é do tipo OPTIONS
        // Obter as credenciais do usuário do corpo da solicitação POST
        $id = $this->request->getVar('id');

        $noticia = $this->request->getVar('noticia');
        $status = $this->request->getVar('status');

        $response = [
            'user_id' => $id,
            'title' => $noticia['title'],
            'description' => $noticia['description'],
            'content' => $noticia['content'],
            'url' => $noticia['url'],
            'image' => $noticia['image'],
            'publishedAt' => $noticia['publishedAt'],
            'source_name' => $noticia['source']['name'],
            'source_url' => $noticia['source']['url'],
            'status' => $status
        ];


        $userModel = new UserModel();
        $FavoriteNewsAdd = new FavoriteNewsAdd();
        $user = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '16'
 LIMIT 1

        if ($noticiasEzistentes) {
            $noticiaFavorita = $FavoriteNewsAdd->where('user_id', $id)->where('title', $noticia['title'])->first();
            $noticiaFavorita['status'] = $status;
            $FavoriteNewsAdd->update($noticiaFavorita['id'], $noticiaFavorita);
            return $this->respond(['valor status' => $noticiaFavorita['status']], 200);
        }
        if (!$noticiasEzistentes) {
            $FavoriteNewsAdd->insert($response);
---
UPDATE `favorite_news` SET `user_id` = '16', `title` = '5 características de empreendedor que você precisa ter', `description` = '5 características de empreendedor que você precisa ter. Confira mais detalhes sobre quais são essas atitudes, no Notícias e Concursos', `content` = 'No mundo de hoje, é possível aprender muitas das características tradicionalmente associadas a empreendedores de sucesso do mundo. Mas, quais são elas e quais são as necessidades para você abrir seu negócio neste momento? Este é o assunto deste artig... [4556 chars]', `url` = 'https://noticiasconcursos.com.br/5-caracteristicas-de-empreendedor-que-voce-precisa-ter/', `image` = 'https://noticiasconcursos.com.br/wp-content/uploads/2023/03/noticiasconcursos.com.br-5-caracteristicas-de-empreendedor-que-voce-precisa-ter-5-caracteristicas-de-um-empreendedor.jpg', `publishedAt` = '2023-03-29T22:20:50Z', `source_name` = 'Notícias Concursos', `source_url` = 'https://noticiasconcursos.com.br', `status` = '1', `updated_at` = '2023-03-29 23:47:01'
WHERE `favorite_news`.`id` IN ('33')
INSERT INTO `favorite_news` (`user_id`, `title`, `description`, `content`, `url`, `image`, `publishedAt`, `source_name`, `source_url`, `status`, `created_at`, `updated_at`) VALUES ('21', 'Acha que sabe puxar o autoclismo? Olhe que não! Está a fazer tudo mal', 'Más notícias...', 'Pela sua saúde, feche sempre o tampo da sanita antes de puxar o autoclismo. Quem o recomenda é Emma Harding, investigadora de virologia molecular e doutoranda da Universidade de Nova Gales do Sul, na Austrália.\nLeia Também: Muito provavelmente, andou... [681 chars]', 'https://www.noticiasaominuto.com/lifestyle/2280561/acha-que-sabe-puxar-o-autoclismo-olhe-que-nao-esta-a-fazer-tudo-mal', 'https://media-manager.noticiasaominuto.com/1280/naom_6424b696c799b.jpg', '2023-03-29T22:07:00Z', 'Notícias ao Minuto', 'https://www.noticiasaominuto.com', '1', '2023-03-29 22:47:43', '2023-03-29 22:47:43')

    public function listarFavoritas()
    {
        $id = $this->request->getVar('id');
        $userModel = new UserModel();
        $user = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '16'
 LIMIT 1