app/Controllers/ReceberUser.php

    public function login()
    {
        // Configurar as headers de CORS para permitir todas as origens
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Headers: *");
        // Verificar se a requisição é do tipo OPTIONS
        // Obter as credenciais do usuário do corpo da solicitação POST
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        if (!$email) {
            return $this->respond(['message' => 'email é obrigatorio.'], 200);
        }
        if (!$password) {
            return $this->respond(['message' => 'senha obrigatoria.'], 200);
        }
        // Verificar se as credenciais são válidas
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'teste@tes.com'
 LIMIT 1